EWSEditor/EwsPostExamples/CreateAttachment.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Body>
    <CreateAttachment xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
                      xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
      <ParentItemId Id="AAAtAE..." ChangeKey="CQAAABYA..."/>
      <Attachments>
        <t:FileAttachment>
          <t:Name>SomeFile</t:Name>
          <t:Content>AQIDBAU=</t:Content>
        </t:FileAttachment>
      </Attachments>
    </CreateAttachment>
  </soap:Body>
</soap:Envelope>